tests/assets/test_suites/w3c_wsdl20/messages/good/InOutComplexTypes-4G/canontoaxis-inout-complextypes.wsimsg

<?xml version="1.0" encoding="UTF-8"?>
<!-- https://dev.w3.org/2002/ws/desc/test-suite/messages/good/InOutComplexTypes-4G/canontoaxis-inout-complextypes.wsimsg -->
<!-- Copyright © 2008 - W3C, (MIT, ERCIM, Keio). All Rights Reserved. http://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231 -->
<log timestamp="2006-07-06T10:52:56.622"
    xmlns="http://www.ws-i.org/testing/2004/07/log/"
    xmlns:wsi-monConfig="http://www.ws-i.org/testing/2004/07/monitorConfig/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <monitor version="1.0" releaseDate="2003-03-20">
    <implementer name="IBM" location=""/>
    <environment>
      <runtime name="Java(TM) 2 Runtime Environment, Standard Edition" version="1.5.0_06-b05"/>
      <operatingSystem name="Windows XP" version="5.1"/>
      <xmlParser name="Apache Xerces" version="Xerces-J 2.8.0"/>
    </environment>
    <wsi-monConfig:configuration>
    <wsi-monConfig:comment>Comment</wsi-monConfig:comment>
      <wsi-monConfig:logFile replace="true" location="URL">
      <wsi-monConfig:addStyleSheet href="null" type="null" />
    </wsi-monConfig:logFile>
      <wsi-monConfig:logDuration>600</wsi-monConfig:logDuration>
      <wsi-monConfig:cleanupTimeoutSeconds>3</wsi-monConfig:cleanupTimeoutSeconds>
      <wsi-monConfig:manInTheMiddle>
      </wsi-monConfig:manInTheMiddle>
    </wsi-monConfig:configuration>
  </monitor>

<messageEntry xsi:type="httpMessageEntry" ID="1" conversationID="1" type="request" timestamp="2006-07-06T10:51:30.057Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStringParam xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;echo string&lt;/ns1:echoStringParam&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>KERGUELEN:1372</senderHostAndPort>
<receiverHostAndPort>chathura.dyndns.ws:8080</receiverHostAndPort>
<httpHeaders>POST /axis2/services/Axis2SampleDocLitService HTTP/1.1&#xd;
Host: chathura.dyndns.ws:8080&#xd;
Pragma: no-cache&#xd;
Accept: */*&#xd;
SOAPAction: &quot;echoString&quot;&#xd;
Content-Type: text/xml&#xd;
Content-Length: 229&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="2" conversationID="1" type="response" timestamp="2006-07-06T10:51:30.228Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStringReturn xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;echo string&lt;/echoStringReturn&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>chathura.dyndns.ws:8080</senderHostAndPort>
<receiverHostAndPort>KERGUELEN:1372</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Server: Apache-Coyote/1.1&#xd;
Set-Cookie: JSESSIONID=FDC509D5E83684959C2E13FE462176FB; Path=/axis2&#xd;
Content-Type: text/xml;charset=UTF-8&#xd;
Transfer-Encoding: chunked&#xd;
Date: Thu, 06 Jul 2006 15:51:20 GMT&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="3" conversationID="2" type="request" timestamp="2006-07-06T10:51:33.382Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStringArrayParam xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;ns1:string&gt;one&lt;/ns1:string&gt;&lt;ns1:string&gt;two&lt;/ns1:string&gt;&lt;ns1:string&gt;three&lt;/ns1:string&gt;&lt;/ns1:echoStringArrayParam&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>KERGUELEN:1374</senderHostAndPort>
<receiverHostAndPort>chathura.dyndns.ws:8080</receiverHostAndPort>
<httpHeaders>POST /axis2/services/Axis2SampleDocLitService HTTP/1.1&#xd;
Host: chathura.dyndns.ws:8080&#xd;
Pragma: no-cache&#xd;
Accept: */*&#xd;
SOAPAction: &quot;echoStringArray&quot;&#xd;
Content-Type: text/xml&#xd;
Content-Length: 314&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="4" conversationID="2" type="response" timestamp="2006-07-06T10:51:33.542Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStringArrayReturn xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;string&gt;one&lt;/string&gt;&lt;string&gt;two&lt;/string&gt;&lt;string&gt;three&lt;/string&gt;&lt;/echoStringArrayReturn&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>chathura.dyndns.ws:8080</senderHostAndPort>
<receiverHostAndPort>KERGUELEN:1374</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Server: Apache-Coyote/1.1&#xd;
Set-Cookie: JSESSIONID=0500E81A26D56826A889BB293CB0C929; Path=/axis2&#xd;
Content-Type: text/xml;charset=UTF-8&#xd;
Transfer-Encoding: chunked&#xd;
Date: Thu, 06 Jul 2006 15:51:23 GMT&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="5" conversationID="3" type="request" timestamp="2006-07-06T10:51:36.927Z">
<messageContent>&lt;?xml version=&quot;1.0&quot;?&gt;&lt;env:Envelope xmlns:env=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;env:Body&gt;&lt;ns1:echoStructParam xmlns:ns1=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;ns1:varFloat&gt;10.000000&lt;/ns1:varFloat&gt;&lt;ns1:varInt&gt;10&lt;/ns1:varInt&gt;&lt;ns1:varString&gt;echo string&lt;/ns1:varString&gt;&lt;/ns1:echoStructParam&gt;&lt;/env:Body&gt;&lt;/env:Envelope&gt;</messageContent>
<senderHostAndPort>KERGUELEN:1376</senderHostAndPort>
<receiverHostAndPort>chathura.dyndns.ws:8080</receiverHostAndPort>
<httpHeaders>POST /axis2/services/Axis2SampleDocLitService HTTP/1.1&#xd;
Host: chathura.dyndns.ws:8080&#xd;
Pragma: no-cache&#xd;
Accept: */*&#xd;
SOAPAction: &quot;echoStruct&quot;&#xd;
Content-Type: text/xml&#xd;
Content-Length: 325&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="6" conversationID="3" type="response" timestamp="2006-07-06T10:51:37.097Z">
<messageContent>&lt;?xml version=&apos;1.0&apos; encoding=&apos;UTF-8&apos;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soapenv:Header /&gt;&lt;soapenv:Body&gt;&lt;echoStructReturn xmlns=&quot;http://userguide.axis2.apache.org/xsd&quot;&gt;&lt;varFloat&gt;10.0&lt;/varFloat&gt;&lt;varInt&gt;10&lt;/varInt&gt;&lt;varString&gt;echo string&lt;/varString&gt;&lt;/echoStructReturn&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>chathura.dyndns.ws:8080</senderHostAndPort>
<receiverHostAndPort>KERGUELEN:1376</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Server: Apache-Coyote/1.1&#xd;
Set-Cookie: JSESSIONID=2C86611C59BA28EDF17DCCFC752DB7B5; Path=/axis2&#xd;
Content-Type: text/xml;charset=UTF-8&#xd;
Transfer-Encoding: chunked&#xd;
Date: Thu, 06 Jul 2006 15:51:27 GMT&#xd;
&#xd;
</httpHeaders>
</messageEntry>
</log>
